Repository: CreativeCubes/busylissy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: nl

source: English
nl: Engels

source: Dutch
nl: Nederlands

source: The model %s has already been registered.
nl: Het model %s staat al geregistreerd

source: created
nl: creeert

source: updated
nl: wijzigt

source: deleted
nl: verwijdert

source: closed
nl: sluit

source: commented on
nl: reageert op

source: invited
nl: verstuurt uitnodiging naar

source: started
nl: start

source: permissions
nl: permissie

source: joined
nl: wordt lid van

source: action
nl: actie

source: time
nl: tijd

source: activity
nl: activiteit

source: activities
nl: activiteiten

source: Sun
nl: Zon

source: Mon
nl: Ma

source: Tue
nl: Di

source: Wed
nl: Wo

source: Thu
nl: Do

source: Fri
nl: Vr

source: Sat
nl: Za

source: Sunday
nl: Zondag

source: Monday
nl: Maandag

source: Tuesday
nl: Dinsdag

source: Wednesday
nl: Woensdag

source: Thursday
nl: Donderdag

source: Friday
nl: Vrijdag

source: Saturday
nl: Zaterdag

source: January
nl: Januari

source: February
nl: Februari

source: March
nl: Maart

source: May
nl: Mei

source: June
nl: Juni

source: July
nl: Juli

source: August
nl: Augustus

source: October
nl: Oktober

source: Oct
nl: Okt

source: first
nl: eerste

source: second
nl: tweede

source: third
nl: derde

source: fourth
nl: vierde

source: last
nl: laatste

source: Day(s)
nl: dag(en)

source: Week(s)
nl: wek(en)

source: Month(s)
nl: Maand(en)

source: Year(s)
nl: ja(a)r(en)

source: By count
nl: Op aantal

source: Until date
nl: tot datum

source: Date
nl: Datum

source: Start time
nl: Begin tijd

source: End time
nl: Eind tijd

source: Occurrences
nl: Gebeurtenissen

source: Total Occurrences
nl: Totaal aantal gebeurtenissen

source: Frequency
nl: Veelvuldig

source: Weekly options
nl: Weekelijkse opties

source: On the
nl: op de

source: Each:
nl: Elke:

source: Monthly options
nl: Maandelijkse opties:

source: Yearly options
nl: Jaarlijkse opties

source: Unknown interval rule %s
nl: Onbekende interval regel %s

source: note
nl: notitie

source: notes
nl: notities

source: abbreviation
nl: afkorting

source: event type
nl: afspraak type

source: event types
nl: afspraak typen

source: title
nl: titel

source: location
nl: locatie

source: event
nl: afspraak

source: events
nl: afspraken

source: start time
nl: begin tijd

source: end time
nl: eind tijd

source: occurrence
nl: gebeurtenis

source: occurrences
nl: gebeurtenissen

source: Event '%(event)s' has been updated
nl: Afspraak '%(event)s' is gewijzigd

source: Event '%(event)s' has been created
nl: Afspraak '%(event)s' is toegevoegd

source: Event '%(event)s' has been deleted
nl: Afspraak '%(event)s' is verwijderd

source: first name
nl: voornaam

source: last name
nl: achternaam

source: phone
nl: telefoonnummer

source: extra information
nl: extra informatie

source: Contacts
nl: Contacten

source: Phone
nl: Telefoonnummer

source: Edit
nl: Wijzig

source: Delete
nl: Verwijder

source: submit
nl: verstuur

source: Add contact
nl: Voeg contact toe

source: Name
nl: Naam

source: The Name will automatically be converted to lowercase. Only letters, numbers, underscores and hyphens are allowed.
nl: De naam zal automatisch worden omgezet naar kleine letters.Alleen letters, cijfer en streepjes zijn toegestaan.

source: Only letters, numbers, underscores and hyphens are allowed.
nl: Alleen letters, cijfers en streepjes zijn toegestaan.

source: The Folder already exists.
nl: Deze map bestaat reeds.

source: Disallowed Folder Name.
nl: Deze naam is niet toegestaan.

source: File
nl: Bestand

source: Use Image Generator
nl: Gebruik plaatjes generator

source: File already exists.
nl: Dit bestand bestaat al.

source: Filename is not allowed.
nl: Deze bestandsnaam is niet toegestaan.

source: File extension is not allowed.
nl: Bestandstype is niet toegestaan.

source: Filesize exceeds allowed Upload Size.
nl: Het bestand is te groot.

source: New Name
nl: Nieuwe naam

source: The File/Folder already exists.
nl: Bestand/map bestaat al.

source: Files
nl: Bestanden

source: FileBrowser
nl: Verkenner

source: The Folder %s was successfully created.
nl: De map %s is aangemaakt.

source: Permission denied.
nl: Toegang geweigerd.

source: Error creating directory.
nl: Er is fout opgetreden.

source: New Folder
nl: Nieuwe map

source: Upload successful.
nl: Bestand toegevoegd.

source: Upload
nl: Toevoegen

source: Select files to upload
nl: Selecteer bestanden om toe te voegen.

source: The file %s was successfully deleted.
nl: Het bestand %s is verwijderd.

source: The directory %s was successfully deleted.
nl: De map %s is verwijderd.

source: Renaming was successful.
nl: Naam is gewijzigd.

source: Error.
nl: Terror.

source: Rename
nl: Naam wijzigen

source: Rename "%s"
nl: Hernoem "%s"

source: Please correct the following errors.
nl: Oeps! Er is iets misgegaan. Controleer de velden.

source: Submit
nl: Verstuur

source: Allowed
nl: Toegestaan

source: Max. Filesize
nl: Max. Bestandsgrootte

source: View Image
nl: Bekijk afbeelding

source: Are you sure you want to delete this file?
nl: Weet je zeker dat dit bestand wilt verwijderen?

source: Delete File
nl: Verwijder bestand

source: Are you sure you want to delete this Folder?
nl: Weet je zeker dat je deze map wilt verwijderen?

source: Delete Folder
nl: Verwijder map

source: By Date
nl: Datum

source: Any Date
nl: Elke datum

source: Today
nl: Vandaag

source: Past 7 days
nl: Afgelopen 7 dagen

source: Past 30 days
nl: Afgelopen 30 dagen

source: This year
nl: Afgelopen jaar

source: By Type
nl: Type

source: All
nl: Allen

source: No Items Found.
nl: Niets gevonden.

source: No Items.
nl: Geen items.

source: Filename
nl: Bestandsnaam

source: Size
nl: Bestandsgrootte

source: Go
nl: Zoek

source: %(counter)s Item found
nl: %(counter)s items gevonden.

source: %(counter)s Item total
nl: %(counter)s items totaal

source: description
nl: omschrijving

source: name
nl: naam

source: members
nl: leden

source: group
nl: groep

source: groups
nl: groepen

source: Group '%(group)s' has been updated
nl: Groep '%(group)s' is gewijzigd

source: Group '%(group)s' has been created
nl: Groep '%(group)s' is aangemaakt

source: Group '%(group)s' has been deleted
nl: Groep '%(group)s' is verwijderd

source: Groups
nl: Groepen

source: Group dashboard
nl: Groep dashboard

source: Messages
nl: Berichten

source: Group
nl: Groep

source: Edit group
nl: Wijzig groep

source: Delete group
nl: Verwijder groep

source: Members
nl: Leden

source: Add member
nl: Voeg leden toe

source: Make admin
nl: Admin maken

source: Add group
nl: Groep toevoegen

source: By
nl: Op

source: Messages in
nl: Berichten in

source: Add thread
nl: Bericht toevoegen

source: Enter at least one username
nl: Vul minimaal een gebruikersnaam in

source: %(username)s is not registered at BusyLissy
nl: %(username)s is niet bekend bij BusyLissy

source: usernames
nl: gebruikersnamen

source: %(username)s is already a member of %(project)s.
nl: %(username)s is al lid van %(project)s.

source: %(username)s already got an invite for this project.
nl: %(username)s heeft al een uitnodiging voor dit project.

source: %(email)s is not a valid e-mail address.
nl: %(email)s is geen e-mailadres.

source: email_addresses
nl: e-mailadressen

source: personal message
nl: Persoonlijk bericht

source: %(email)s already got an invite for this project.
nl: %(email)s heeft al een uitnodiging voor dit project.

source: %(email)s is already a member of this project
nl: %(email)s is al lid van dit project

source: None
nl: Geen

source: Accepted
nl: Geaccepteerd

source: Declined
nl: Geweigerd

source: You received an invitation to join %(project)s
nl: Je bent uitgenodigd voor %(project)s

source: date
nl: datum

source: I would like to add you to my project on BusyLissy.
nl: Ik wil je graag toevoegen aan mijn project op BusyLissy

source: %(amount)s invite(s) has been sent out.
nl: %(amount)s uitnodiging(en) zijn er verstuurd.

source: Your invite to %(invited)s has been sent out.
nl: Uitnodiging is verstuurd naar %(invited)s.

source: %(amount)s invites has been sent out.
nl: %(amount)s uitnodigingen zijn er verstuurd.

source: You have been added to %(project)s.
nl: Je bent uitgenodigd voor %(project)s

source: %(username)s has been added to %(project)s. Login as him to go to this project.
nl: %(username)s is toegevoegd aan %(project)s. Login op dit account om naar het project te gaan.

source: You have declined the invitation to %(project)s.
nl: Je hebt de uitnodiging voor %(project)s geweigerd.

source: message
nl: bericht

source: Message should be longer than 5 characters.
nl: Bericht moet minimaal 5 karakters bevatten.

source: body
nl: bericht

source: latest message time
nl: laatste bericht

source: total amount of messages
nl: totaal aantal berichten

source: thread
nl: bericht

source: threads
nl: berichten

source: created_at
nl: aangemaakt op

source: messages
nl: berichten

source: Your message has been posted
nl: Bericht is geplaatst.

source: Thread '%(thread)s' has been created
nl: Bericht '%(thread)s' is aangemaakt

source: Thread '%(thread)s' has been updated
nl: Bericht '%(thread)s' is gewijzigd

source: Thread '%(thread)s' has been deleted
nl: Bericht '%(thread)s' is verwijderd

source: Your message has been updated
nl: Bericht is gewijzigd

source: Your message has been deleted
nl: Bericht is verwijderd

source: Thank you for your feedback
nl: Dankjewel voor de feedback

source: Messages for
nl: Berichten voor

source: Can only contain letters, numbers and spaces
nl: Mag alleen letters, cijfers en spaties bevatten

source: First name
nl: Voornaam

source: Last name
nl: Achternaam

source: Username contains only letters and numbers
nl: Gebruikersnaam mag alleen letters en cijfers bevatten

source: username
nl: gebruikersnaam

source: One of the usernames does not exist
nl: Een van de gebruikersnamen bestaat niet

source: Username does not exist
nl: Sorry, deze gebruikersnaam kan ik echt niet vinden

source: email address
nl: e-mailadres

source: BusyLissy: Invite for
nl: Busylissy: uitnodiging voor

source: Male
nl: Mannetje

source: Female
nl: Vrouwtje

source: gender
nl: Geslacht

source: birth date
nl: geboortedatum

source: about me
nl: over mij

source: notifications
nl: notificaties

source: I want to receive notifications of activities in my projects
nl: notificaties ontvangen per e-mail

source: language
nl: taal

source: is public
nl: is publiek

source: Profile is visible for others.
nl: Profiel is zichtbaar voor anderen.

source: Your profile has been updated
nl: Profiel is spiksplinternieuw

source: Profile has been deleted
nl: Profiel is verwijderd

source: Invite for '%(project)s' has been send to '%(invite)s'
nl: Uitnodigin voor '%(project)s' is verstuurd naar '%(invite)s'

source: Members '%(member)s' have been invited to '%(project)s'
nl: Gebruikers '%(member)s' zijn uitgenodigd voor '%(project)s'

source: Member '%(member)s' has been invited to '%(project)s'
nl: Gebruiker '%(member)s' is uitgenodigd voor '%(project)s'

source: Member '%(member)s' has been removed from '%(project)s'
nl: Gebruiker '%(member)s' is verwijderd van '%(project)s'

source: You have resigned from '%(project)s'
nl: Je bent afgemeld voor '%(project)s'

source: Member '%(member)s' has been granted admin permissions for '%(project)s'
nl: '%(member)s' heeft admin rechten gekregen voor '%(project)s'

source: Your settings have been updated
nl: Instellingen zijn gewijzigd

source: Edit my profile
nl: Wijzig profiel

source: Change password
nl: Wijzig wachtwoord

source: Delete my profile
nl: Verwijder profiel

source: Profile of
nl: Profiel van

source: Gender
nl: Geslacht

source: Age
nl: Leeftijd

source: About me
nl: Over mij

source: User has no profile
nl: Gebruiker heeft geen profiel

source: Project name is not allowed
nl: Projectnaam niet toegestaan

source: On Hold
nl: Gepauzeerd

source: In Progress
nl: Actief

source: Finished
nl: Afgerond

source: projects
nl: projecten

source: Project '%(project)s' has been updated
nl: Project '%(project)s' is gewijzigd

source: Project '%(project)s' has been created
nl: Project '%(project)s' is spiksplinternieuw

source: Project '%(project)s' has been deleted
nl: Project '%(project)s' is verwijderd

source: Projects
nl: Projecten

source: Back to all projects
nl: Terug naar overzicht projecten

source: Tasks
nl: Taken

source: Edit project
nl: Wijzig project

source: Delete project
nl: Verwijder project

source: Activities
nl: Activiteiten

source: ago
nl: geleden

source: Project members
nl: Projectleden

source: Active
nl: Actief

source: Add project
nl: Project toevoegen

source: year
nl: jaar

source: day
nl: dag

source: hour
nl: uur

source: minute
nl: minuut

source: years
nl: jaar

source: weeks
nl: weken

source: days
nl: dagen

source: hours
nl: uur

source: minutes
nl: minuten

source: a few seconds
nl: een aantal seconden

source: completed
nl: afgerond

source: completed date
nl: afrondingsdatum

source: due date
nl: afronden voor

source: assigned to
nl: toegewezen aan

source: created by
nl: gecreeerd door

source: Task '%(name)s' has been updated
nl: Taak '%(name)s' is gewijzigd

source: Task '%(name)s' has been created
nl: Taak '%(name)s' is aangemaakt

source: Task '%(name)s' has been deleted
nl: Taak '%(name)s' is verwijderd

source: Task '%(name)s' has been completed
nl: Taak '%(name)s' is afgerond

source: Task '%(name)s' has been marked as incomplete
nl: Taak '%(name)s' is nog lang niet af

source: Tags used in project
nl: Tags gebruikt in dit project

source: Add todo
nl: Voeg taak toe

source: days left
nl: dagen te gaan

source: days late
nl: dagen te laat

source: no milestones
nl: geen mijlpalen

source: Back to
nl: Terug naar

source: Oops! Something went wrong!
nl: Oeps! Er is een fout opgetreden!

source: Edit Profile
nl: Wijzig Profiel

source: Settings
nl: Instellingen

source: Sign out
nl: Uitloggen

source: Give us feedback
nl: Geef feedback

source: X Close
nl: X Sluiten

source: BusyLissy is a product of
nl: Busylissy is een product van

source: Associate account
nl: Koppel account

source: Add a new OpenID URL
nl: Voeg een nieuwe OpenID URL toe

source: Please click your account provider
nl: Klik op je openID provider

source: Add OpenID
nl: Voeg OpenID toe

source: Your OpenID is verified!
nl: OpenID is geverifieerd!

source: Associate your OpenID
nl: Koppel OpenID

source: <h5 class="associate-text">Your OpenID can now be associated with a <strong>new</strong> or <strong>existing</strong> account.</h5>
nl: <h5 class="associate-text">Jouw OpenID kan vanaf nu gekoppeld worden aan een <strong>nieuw</strong> of <strong>bestaand</strong> BusyLissy account.</h5>

source: Create a new account
nl: Regsistreer

source: Please correct errors below:
nl: Oeps! Er gaat wat mis:

source: Username
nl: Gebruikersnaam

source: Associate with existing account
nl: Koppel account

source: Password
nl: Wachtwoord

source: Dissociate OpenID URL
nl: Ontkoppel OpenID URL

source: Dissociate OpenID
nl: Ontkoppel OpenID

source: New password:
nl: Nieuw wachtwoord:

source: Confirm password:
nl: Bevestig wachtwoord:

source: Change my password
nl: Wachtwoord wijzigen

source: Password change
nl: Wachtwoord wijzigen

source: Old password:
nl: Huidig wachtwoord:

source: Sign in
nl: Inloggen

source: Not yet an account?
nl: Nog geen account?

source: Sign Up
nl: Registreren

source: Forgot password
nl: Wachtwoord vergeten

source: or even easier
nl: of nog makkelijker

source: Sign in with your OpenID
nl: Inloggen met OpenID

source: Sign in with OpenID
nl: Inloggen met OpenID

source: Agenda add Event
nl: Agenda afspraak toevoegen

source: Add event
nl: Afspraak toevoegen

source: Please fix any errors.
nl: Oeps! Er is iets misgegaan. Controleer de velden.

source: By type
nl: Op soort

source: Event
nl: Afspraak

source: Task
nl: Taak

source: By member
nl: Op projectleden

source: New Event
nl: Nieuwe afspraak

source: at
nl: bij

source: Close
nl: Sluiten

source: Edit event
nl: Afspraak wijzigen

source: or
nl: of

source: Delete this event
nl: Verwijder afsrpaak

source: By project
nl: Op project

source: All projects
nl: Projecten

source: + New file
nl: + Nieuw bestand

source: + New Folder
nl: + Nieuwe map

source: No files found
nl: Niets gevonden.

source: Filter Files
nl: Filter bestanden

source: Filter Groups
nl: Filter groepen

source: Overview
nl: Overzicht

source: Invite people
nl: Nodig mensen uit

source: Invite by username
nl: Uitnodigen via gebruikersnaam

source: invite
nl: uitnodigen

source: Click avatar to invite
nl: Klik op de avatar om de gebruiker uit te nodigen

source: Invite by email
nl: Uitnodigen via e-mail

source: Sign up
nl: Registreren

source: To join
nl: Lid worden van

source: please sign up
nl: inloggen

source: Sign up with your OpenID
nl: Inloggen met OpenID

source: Error while submitting form
nl: Oeps! Er ging iets mis

source: Please give us feedback
nl: Geef ons feedback

source: Send Feedback
nl: Geef feedback

source: Thank you very much
nl: Dankjewel

source: We really appriciate it. Due to your feedback we can make this product even better
nl: Je feedback wordt erg op prijs gesteld. Dankzij jouw feedback kunnen wij Busylissy nog beter maken

source: Filter Messages
nl: Filter berichten

source: Add tag to task
nl: Voeg tag toe aan taak

source: No tags yet
nl: Nog niks getagged

source: New Message
nl: Nieuw bericht

source: No messages yet
nl: berichten

source: Create a new message
nl: Plaats een nieuw bericht

source: This is were we
nl: Hier

source: talk about the developments
nl: kan je de ontwikkelingen volgen

source: comments
nl: Comment

source: Read more
nl: Lees meer

source: Comments
nl: Comment

source: Development blog
nl: Blog met ontwikkelingen

source: Latest posts
nl: Laatste artikelen

source: Categories
nl: Categorien

source: Edit profile
nl: Wijzig Profiel

source: This week
nl: Deze week

source: Go to agenda
nl: Ga naar agenda

source: Latest activities
nl: Laatste activiteiten

source: See more
nl: Bekijk meer

source: Filter Projects
nl: Filter projecten

source: Accept
nl: Accepteren

source: Decline
nl: Weigeren

source: Used tags
nl: Gebruikte tags

source: Congratulations with your BusyLissy Account
nl: Gefeliciteerd met jouw BusyLissy account

source: You have no projects yet
nl: Je hebt nog geen projecten

source: ..so let&#180;s get busy
nl: ..dus let&#180;s get busy

source: New Project
nl: Nieuw project

source: + New Project
nl: + Nieuw project

source: Projects on hold
nl: Gepauzeerde projecten

source: Finished projects
nl: Afgeronde projecten

source: Active projects
nl: Actieve projecten

source: Your tasks
nl: Mijn taken

source: New messages
nl: Nieuw bericht

source: Latest activity
nl: Laatste activiteiten

source: by
nl: door

source: No activities yet.
nl: Nog geen activiteit.

source: Progress
nl: Voortgang

source: no tags yet
nl: vooralsnog geen tags

source: Add People
nl: Nieuw projectlid

source: Filter tasks
nl: Filter taken

source: New Task
nl: Nieuwe taak

source: Hide Completed
nl: Verberg afgeronde taken

source: Show Completed
nl: Toon afgeronde taken

source: left
nl: te gaan

source: No tasks yet
nl: Mijn taken

source: Create a new task
nl: Nieuwe taak

source: My tasks
nl: Mijn taken

source: Approve a comment
nl: Keur deze comment goed

source: Really make this comment public?
nl: Weet je zeker dat deze comment publiekelijk mag zijn?

source: Approve
nl: Goedkeuren

source: Thanks for approving
nl: Bedankt voor de goedkeuring

source: Thanks for taking the time to improve the quality of discussion on our site
nl: Wij stellen het zeer op prijs dat je aandacht besteed aan het verbeteren van onze website

source: Remove a comment
nl: Verwijder comment

source: Really remove this comment?
nl: Weet je zeker dat je deze comment wilt verwijderen?

source: Remove
nl: Verwijder

source: Thanks for removing
nl: Bedankt voor het verwijderen

source: Flag this comment
nl: Geef deze comment aan

source: Really flag this comment?
nl: Weet je zeker dat je deze comment wilt aangeven?

source: Flag
nl: Aangeven voor misbruik

source: Thanks for flagging
nl: Bedankt voor het aangeven van deze comment

source: Post your comment
nl: Plaats comment

source: Email address
nl: E-mailadres

source: Comment moderation queue
nl: Comment beheer status

source: No comments to moderate
nl: Geen comments om te beheren

source: Action
nl: Actie

source: Authenticated?
nl: Toegang?

source: IP Address
nl: IP adres

source: Date posted
nl: Datum geplaatst

source: yes
nl: ja

source: no
nl: nee

source: Thanks for commenting
nl: Bedankt voor je comment

source: Thank you for your comment
nl: Dankjewel voor je comment

source: Error in your comment
nl: Fout opgetreden in jouw comment

source: Please correct the error below
nl: Oeps! Er is wat mis gegaan, controleer de velden.

source: Preview your comment
nl: Bekijk je comment

source: and
nl: en

source: or make changes
nl: of maak veranderingen

source: Your account is now activated
nl: Jouw Busylissy account is geactiveerd

source: Please sign in
nl: Klik hier om in te loggen

source: Activation complete
nl: Geregistreerd

source: Your account has been activated, please sign in.
nl: Jouw Busylissy account is geactiveerd.

source: Logged out
nl: Uitgelogd

source: You are logged out
nl: Je bent uitgelogd

source: Thanks for spending some quality time with BusyLissy today
nl: Bedankt voor het gebruiken van Busylissy vandaag

source: Password reset complete
nl: Wachtwoord resetten compleet

source: Your password has been set. You may go ahead and log in now.
nl: Je hebt een nieuw wachtwoord. Ga verder om in te loggen.

source: Log in
nl: Inloggen

source: Password reset
nl: Wachtwoord resetten

source: Enter new password
nl: Nieuw wachtwoord

source: Please enter your new password twice so we can verify you typed it in correctly.
nl: Vul je wachtwoord twee maal in zodat wij kunnen verifieren dat het correct is.

source: Password reset unsuccessful
nl: Wachtwoord resetten mislukt

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
nl: De wachtwoord reset link was niet goed, mogelijk is het al gebruikt. Vraag een nieuwe aan.

source: <h2>Password reset</h2> <p>We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.</p>
nl: <h2>Wachtwoord resetten</h2> <p>Er is een e-mail verstuurd met de instructies om het wachtwoord te resetten. Het kan even duren voordat hij binnen is.</p>

source: You're receiving this e-mail because you requested a password reset
nl: Je ontvangt deze e-mail om iemand een wachtwoord reset heeft aangevraagd

source: for your user account at %(site_name)s
nl: voor je profiel op %(site_name)s

source: Please go to the following page and choose a new password:
nl: Ga door naar de volgende pagina om een nieuw wachtwoord te kiezen:

source: Your username, in case you've forgotten:
nl: Jouw gebruikersnaam indien je het vergeten was:

source: Back to sign In
nl: Terug naar inloggen

source: Please fill in your e-mailaddress and we will send you your new password
nl: Vul je e-mailadres in en we sturen je wachtwoord toe

source: Send password
nl: Verstuur

source: Sign up complete
nl: Geregistreerd

source: Thank you
nl: Dankjewel

source: An email has been sent to you. You need to click the link to activate your account
nl: Wij hebben een bericht naar jouw digitale brievenbus verstuurd. Klik op de link in dit bericht om jouw account te activeren

source: Already an account?
nl: Heb je al een account?

source: Sign In
nl: Inloggen

source: Super simple
nl: Super simpel

source: Sign up now
nl: Meld je nu aan

source: Don't worry. It's free.
nl: Waarom niet? Het is gratis.

source: What is it
nl: Wat is het
