Repository: CreativeCubes/busylissy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: nl

source: BusyLissy is a super simple project management tool. Work together, organise stuff and keep track of the developments within your projects.
nl: BusyLissy is een super simpele project management tool. Werk samen, organiseer van alles en blijf op de hoogte van de ontwikkelingen in jouw projecten.

source: Who is it for
nl: Voor wie is het

source: BusyLissy is for everybody who want to organise stuff together. Small businesses, student groups, sports clubs, you name it. Let's get Busy
nl: BusyLissy is er voor iedereen die samen dingen willen organiseren. Bedrijven, studenten, sportverenigingen noem het maar op. Let's get Busy

source: Why use it
nl: Waarom

source: BusyLissy makes organising and project management super simple. All the messages, tasks and files in one place makes your lve easier.
nl: BusyLissy maakt organiseren een eitje. Alle berichten, taken en bestanden op een plaats. Maak het niet moeilijker dan het is.

source: Task lists
nl: Taken lijst

source: Create tasks and sub-tasks for any project. Assign tasks to certain project members and keep track of what has to be done.
nl: Taken en subtaken voor elk project. Verdeel de taken over de projectleden en hou het overzicht over wat er moet gebeuren.

source: Discuss your project and keep al your messages in one place. Keep a good overview of what is happening in your project.
nl: Bespreek de projecten op een plaats. Hou overzicht wat er gebeurt binnen een project.

source: File sharing
nl: Deel bestanden

source: Store all your files and documents in one place. forget emailing eachother with attachements Lissy organises the files for you.
nl: Alle bestanden en documenten op een plaats. Geen e-mails meer met bijlagen. Lissy bewaart alle bestanden voor je.

source: Start organising stuff together.
nl: Start nu je eerste project

source: Sign up for free
nl: Meld je gratis aan

source: Create and share events within a project. Milestones automatically appear in your agenda. Use your personal agenda to track events throughout all of your projects.
nl: Maak en deel je afpraken binnen een project. Deadlines komen automatisch in de agenda te staan. Gebruik de persoonlijke agenda om alle afspraken van je projecten te beheren.
